[
  {
    "name": "Mario (8-Bit)",
    "id": 1,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "The classic 8-bit version of Mario, the iconic hero of the Mushroom Kingdom, also appearing in the Cap Kingdom for nostalgic adventures."
  },
  {
    "name": "Big Chain Chomp",
    "id": 2,
    "city": ["Bowser's Kingdom", "Ruined Kingdom"],
    "description": "A massive and menacing Chain Chomp used by Bowser to guard his fortress, also found in the ruins of the Ruined Kingdom."
  },
  {
    "name": "Bird (Forest)",
    "id": 3,
    "city": ["Wooded Kingdom", "Mushroom Kingdom"],
    "description": "A small bird commonly found in the forests of the Wooded Kingdom, also seen in the Mushroom Kingdom's wooded areas."
  },
  {
    "name": "Bird (Eagle)",
    "id": 4,
    "city": ["Cloud Kingdom", "Cascade Kingdom"],
    "description": "A majestic eagle soaring high above the clouds in the Cloud Kingdom, occasionally spotted near the waterfalls of the Cascade Kingdom."
  },
  {
    "name": "Bird (Lake)",
    "id": 5,
    "city": ["Lake Kingdom", "Seaside Kingdom"],
    "description": "A graceful bird often seen near the tranquil waters of the Lake Kingdom, also found along the shores of the Seaside Kingdom."
  },
  {
    "name": "Bird (Gull)",
    "id": 6,
    "city": ["Seaside Kingdom", "Lake Kingdom"],
    "description": "A seagull flying over the beaches and oceans of the Seaside Kingdom, occasionally visiting the Lake Kingdom."
  },
  {
    "name": "Bird (Lava)",
    "id": 7,
    "city": ["Luncheon Kingdom", "Bowser's Kingdom"],
    "description": "A fiery bird adapted to the extreme heat of the Luncheon Kingdom's lava-filled terrain, also seen in Bowser's Kingdom."
  },
  {
    "name": "Bird (Sand)",
    "id": 8,
    "city": ["Sand Kingdom", "Ruined Kingdom"],
    "description": "A desert bird thriving in the arid environment of the Sand Kingdom, also found in the ruins of the Ruined Kingdom."
  },
  {
    "name": "Bird (Snow)",
    "id": 9,
    "city": ["Snow Kingdom", "Mushroom Kingdom"],
    "description": "A hardy bird that endures the cold climate of the Snow Kingdom, occasionally seen in the Mushroom Kingdom during winter."
  },
  {
    "name": "Bird (Waterfall)",
    "id": 10,
    "city": ["Cascade Kingdom", "Lake Kingdom"],
    "description": "A bird often seen near the cascading waterfalls of the Cascade Kingdom, also found near the Lake Kingdom's waters."
  },
  {
    "name": "Bomb Tail",
    "id": 11,
    "city": ["Cap Kingdom", "Bowser's Kingdom"],
    "description": "A creature with a bomb-like tail, often found in the Cap Kingdom, also used by Bowser's forces in his kingdom."
  },
  {
    "name": "Bonneton Female",
    "id": 12,
    "city": ["Cap Kingdom", "Mushroom Kingdom"],
    "description": "A female resident of Bonneton, the main town in the Cap Kingdom, occasionally visiting the Mushroom Kingdom."
  },
  {
    "name": "Bonneton Male",
    "id": 13,
    "city": ["Cap Kingdom", "Mushroom Kingdom"],
    "description": "A male resident of Bonneton, the main town in the Cap Kingdom, occasionally visiting the Mushroom Kingdom."
  },
  {
    "name": "Bowser",
    "id": 14,
    "city": ["Bowser's Kingdom", "Mushroom Kingdom"],
    "description": "The King of the Koopas and Mario's arch-nemesis, often seen in his kingdom but also invading the Mushroom Kingdom."
  },
  {
    "name": "Bowser (Ball A)",
    "id": 15,
    "city": ["Bowser's Kingdom", "Ruined Kingdom"],
    "description": "A spherical form of Bowser used in certain battles, also appearing in the Ruined Kingdom."
  },
  {
    "name": "Bowser (Ball B)",
    "id": 16,
    "city": ["Bowser's Kingdom", "Ruined Kingdom"],
    "description": "Another spherical form of Bowser with enhanced abilities, also appearing in the Ruined Kingdom."
  },
  {
    "name": "Bowser (Hat)",
    "id": 17,
    "city": ["Bowser's Kingdom", "Cap Kingdom"],
    "description": "Bowser's special hat, granting him unique powers, also seen in the Cap Kingdom."
  },
  {
    "name": "Bowser (Suit)",
    "id": 18,
    "city": ["Bowser's Kingdom", "Metro Kingdom"],
    "description": "Bowser in a magnificent suit, often seen in his kingdom but also making appearances in the Metro Kingdom."
  },
  {
    "name": "Breeda",
    "id": 19,
    "city": ["Cap Kingdom", "Moon Kingdom"],
    "description": "An antagonist who causes trouble and challenges Mario throughout his journey, appearing in both the Cap and Moon Kingdoms."
  },
  {
    "name": "Breeda (Wanwan)",
    "id": 20,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "Breeda's playful dog companion, Wanwan, often seen in the Mushroom Kingdom but also accompanying Breeda in the Cap Kingdom."
  },
  {
    "name": "Breeda (Wanwan Break)",
    "id": 21,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "Wanwan taking a break from its playful antics, often seen in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Burrbo",
    "id": 22,
    "city": ["Mushroom Kingdom", "Wooded Kingdom"],
    "description": "A small, burrowing creature found in grassy areas of the Mushroom Kingdom, also seen in the Wooded Kingdom."
  },
  {
    "name": "Burrbo (Ruined Kingdom)",
    "id": 23,
    "city": ["Ruined Kingdom", "Sand Kingdom"],
    "description": "A variant of Burrbo adapted to the ruins of the Ruined Kingdom, also found in the Sand Kingdom."
  },
  {
    "name": "Byugo",
    "id": 24,
    "city": ["Lake Kingdom", "Seaside Kingdom"],
    "description": "A large, aquatic creature found in the waters of the Lake Kingdom, also seen in the Seaside Kingdom."
  },
  {
    "name": "Cappy",
    "id": 25,
    "city": ["Cap Kingdom", "Mushroom Kingdom"],
    "description": "A sentient hat that helps Mario on his adventures by possessing enemies and objects, primarily found in the Cap Kingdom but also assisting in the Mushroom Kingdom."
  },
  {
    "name": "Captain Toad",
    "id": 26,
    "city": ["Mushroom Kingdom", "Cascade Kingdom"],
    "description": "A brave and resourceful Toad who embarks on his own adventures, often seen in the Mushroom Kingdom but also exploring the Cascade Kingdom."
  },
  {
    "name": "Catch Bomb",
    "id": 27,
    "city": ["Bowser's Kingdom", "Ruined Kingdom"],
    "description": "A bomb-like enemy that can be caught and thrown, primarily found in Bowser's Kingdom but also appearing in the Ruined Kingdom."
  },
  {
    "name": "Chain Chomp",
    "id": 28,
    "city": ["Bowser's Kingdom", "Mushroom Kingdom"],
    "description": "A ferocious, ball-and-chain enemy often used as a guard in Bowser's Kingdom, also seen in the Mushroom Kingdom."
  },
  {
    "name": "Chargin' Chuck",
    "id": 29,
    "city": ["Mushroom Kingdom", "Bowser's Kingdom"],
    "description": "A football-themed Koopa Troopa known for charging at enemies, primarily found in the Mushroom Kingdom but also in Bowser's Kingdom."
  },
  {
    "name": "Collect Animal",
    "id": 30,
    "city": ["Mushroom Kingdom", "Wooded Kingdom"],
    "description": "A small, collectible creature found throughout the kingdoms, often seen in the Mushroom Kingdom but also in the Wooded Kingdom."
  },
  {
    "name": "Desert Man",
    "id": 31,
    "city": ["Sand Kingdom", "Ruined Kingdom"],
    "description": "A resident of the Sand Kingdom, adapted to the desert environment, also found in the Ruined Kingdom."
  },
  {
    "name": "Desert Man (L)",
    "id": 32,
    "city": ["Sand Kingdom", "Ruined Kingdom"],
    "description": "A larger variant of the Desert Man, primarily found in the Sand Kingdom but also in the Ruined Kingdom."
  },
  {
    "name": "Donsuke",
    "id": 33,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A friendly NPC who offers quests and rewards, often seen in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Doshi",
    "id": 34,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A wise NPC who provides guidance and information, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Fire Bros",
    "id": 35,
    "city": ["Bowser's Kingdom", "Mushroom Kingdom"],
    "description": "Koopa Troopas that throw fireballs at their enemies, primarily found in Bowser's Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Frog",
    "id": 36,
    "city": ["Lake Kingdom", "Seaside Kingdom"],
    "description": "A small amphibian found near water sources in the Lake Kingdom, also seen in the Seaside Kingdom."
  },
  {
    "name": "Fuzzy",
    "id": 37,
    "city": ["Wooded Kingdom", "Mushroom Kingdom"],
    "description": "A fuzzy, spider-like enemy that clings to walls and ceilings, primarily found in the Wooded Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Gamane",
    "id": 38,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A quirky NPC with a unique personality, often seen in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Giant Wander Boss",
    "id": 39,
    "city": ["Mushroom Kingdom", "Ruined Kingdom"],
    "description": "A massive, wandering boss that appears in multiple kingdoms, primarily in the Mushroom Kingdom but also in the Ruined Kingdom."
  },
  {
    "name": "Glydon",
    "id": 40,
    "city": ["Cloud Kingdom", "Cascade Kingdom"],
    "description": "A gliding creature that helps Mario traverse large gaps, primarily found in the Cloud Kingdom but also in the Cascade Kingdom."
  },
  {
    "name": "Golem (Climb)",
    "id": 41,
    "city": ["Ruined Kingdom", "Cascade Kingdom"],
    "description": "A stone golem that Mario can climb to reach high places, primarily found in the Ruined Kingdom but also in the Cascade Kingdom."
  },
  {
    "name": "Goomba",
    "id": 42,
    "city": ["Mushroom Kingdom", "Bowser's Kingdom"],
    "description": "A common, mushroom-shaped enemy found throughout the kingdoms, primarily in the Mushroom Kingdom but also in Bowser's Kingdom."
  },
  {
    "name": "Goombette",
    "id": 43,
    "city": ["Mushroom Kingdom", "Bowser's Kingdom"],
    "description": "A female variant of the Goomba, often seen in groups, primarily in the Mushroom Kingdom but also in Bowser's Kingdom."
  },
  {
    "name": "Grower Bug",
    "id": 44,
    "city": ["Wooded Kingdom", "Mushroom Kingdom"],
    "description": "A bug-like creature that helps plants grow, primarily found in the Wooded Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Grower Worm",
    "id": 45,
    "city": ["Wooded Kingdom", "Mushroom Kingdom"],
    "description": "A worm-like creature that aids in plant growth, primarily found in the Wooded Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Hammer Bros",
    "id": 46,
    "city": ["Bowser's Kingdom", "Mushroom Kingdom"],
    "description": "Koopa Troopas that throw hammers at their enemies, primarily found in Bowser's Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Hint Toad",
    "id": 47,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A helpful Toad who provides hints and tips to Mario, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Hosui Core",
    "id": 48,
    "city": ["Lake Kingdom", "Seaside Kingdom"],
    "description": "A core energy source found in the Lake Kingdom, also seen in the Seaside Kingdom."
  },
  {
    "name": "Imomu",
    "id": 49,
    "city": ["Mushroom Kingdom", "Wooded Kingdom"],
    "description": "A small, timid creature often found hiding in the Mushroom Kingdom, also seen in the Wooded Kingdom."
  },
  {
    "name": "Joku",
    "id": 50,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A mysterious NPC with a cryptic personality, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Jugem",
    "id": 51,
    "city": ["Cloud Kingdom", "Cascade Kingdom"],
    "description": "A cloud-like creature that helps Mario traverse the skies, primarily found in the Cloud Kingdom but also in the Cascade Kingdom."
  },
  {
    "name": "Jugem (Cloud)",
    "id": 52,
    "city": ["Cloud Kingdom", "Cascade Kingdom"],
    "description": "A variant of Jugem that blends in with the clouds, primarily found in the Cloud Kingdom but also in the Cascade Kingdom."
  },
  {
    "name": "Karon Wing",
    "id": 53,
    "city": ["Bowser's Kingdom", "Ruined Kingdom"],
    "description": "A winged variant of the Karon enemy, primarily found in Bowser's Kingdom but also in the Ruined Kingdom."
  },
  {
    "name": "Killer",
    "id": 54,
    "city": ["Bowser's Kingdom", "Ruined Kingdom"],
    "description": "A dangerous enemy that relentlessly pursues Mario, primarily found in Bowser's Kingdom but also in the Ruined Kingdom."
  },
  {
    "name": "Killer (Magnum)",
    "id": 55,
    "city": ["Bowser's Kingdom", "Ruined Kingdom"],
    "description": "A more powerful variant of the Killer enemy, primarily found in Bowser's Kingdom but also in the Ruined Kingdom."
  },
  {
    "name": "Kinopio NPC",
    "id": 56,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A Toad NPC who provides quests and information, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Klepto",
    "id": 57,
    "city": ["Cloud Kingdom", "Cascade Kingdom"],
    "description": "A thieving bird that steals items from Mario, primarily found in the Cloud Kingdom but also in the Cascade Kingdom."
  },
  {
    "name": "Kuribo Mini",
    "id": 58,
    "city": ["Mushroom Kingdom", "Bowser's Kingdom"],
    "description": "A small, harmless variant of the Kuribo enemy, primarily found in the Mushroom Kingdom but also in Bowser's Kingdom."
  },
  {
    "name": "Lochlady",
    "id": 59,
    "city": ["Lake Kingdom", "Seaside Kingdom"],
    "description": "A mystical lady who resides in the waters of the Lake Kingdom, also seen in the Seaside Kingdom."
  },
  {
    "name": "Luigi",
    "id": 60,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "Mario's taller, younger brother and a hero in his own right, often seen in the Mushroom Kingdom but also assisting in the Cap Kingdom."
  },
  {
    "name": "Mario (64)",
    "id": 61,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "The polygonal version of Mario from the classic Nintendo 64 era, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Mario (Aviator)",
    "id": 62,
    "city": ["Cloud Kingdom", "Cascade Kingdom"],
    "description": "Mario dressed in an aviator outfit, ready to take to the skies, primarily found in the Cloud Kingdom but also in the Cascade Kingdom."
  },
  {
    "name": "Mario (Baseball)",
    "id": 63,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario in his baseball uniform, ready to hit a home run, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Mario (Black Suit)",
    "id": 64,
    "city": ["Metro Kingdom", "Mushroom Kingdom"],
    "description": "Mario in a sleek black suit, perfect for formal occasions, primarily found in the Metro Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Black Tuxedo)",
    "id": 65,
    "city": ["Metro Kingdom", "Mushroom Kingdom"],
    "description": "Mario in a stylish black tuxedo, ready for a night out, primarily found in the Metro Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Bowser)",
    "id": 66,
    "city": ["Bowser's Kingdom", "Mushroom Kingdom"],
    "description": "Mario wearing a Bowser-themed costume, blending in with his enemies, primarily found in Bowser's Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Boxers)",
    "id": 67,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "Mario in his casual boxer shorts, relaxing at home, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Mario (Builder)",
    "id": 68,
    "city": ["Cascade Kingdom", "Mushroom Kingdom"],
    "description": "Mario in his builder outfit, ready to construct and repair, primarily found in the Cascade Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Caveman)",
    "id": 69,
    "city": ["Cascade Kingdom", "Ruined Kingdom"],
    "description": "Mario dressed as a caveman, exploring prehistoric areas, primarily found in the Cascade Kingdom but also in the Ruined Kingdom."
  },
  {
    "name": "Mario (Chef)",
    "id": 70,
    "city": ["Luncheon Kingdom", "Mushroom Kingdom"],
    "description": "Mario in his chef outfit, cooking up delicious meals, primarily found in the Luncheon Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Classic)",
    "id": 71,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "Mario in his classic red and blue outfit, as seen in early games, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Mario (Clown)",
    "id": 72,
    "city": ["Cap Kingdom", "Mushroom Kingdom"],
    "description": "Mario dressed as a clown, bringing joy and laughter, primarily found in the Cap Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Cowboy)",
    "id": 73,
    "city": ["Sand Kingdom", "Mushroom Kingdom"],
    "description": "Mario in a cowboy outfit, exploring the Wild West-inspired desert, primarily found in the Sand Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Diddy Kong)",
    "id": 74,
    "city": ["Wooded Kingdom", "Mushroom Kingdom"],
    "description": "Mario wearing a Diddy Kong-themed costume, blending in with the jungle, primarily found in the Wooded Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Doctor)",
    "id": 75,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario in his doctor outfit, ready to heal and help, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Mario (Employee)",
    "id": 77,
    "city": ["Metro Kingdom", "Mushroom Kingdom"],
    "description": "Mario in a business suit, working in the bustling city, primarily found in the Metro Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Explorer)",
    "id": 78,
    "city": ["Mushroom Kingdom", "Cascade Kingdom"],
    "description": "Mario in his explorer outfit, ready to discover new lands, primarily found in the Mushroom Kingdom but also in the Cascade Kingdom."
  },
  {
    "name": "Mario (Fashionable)",
    "id": 79,
    "city": ["Metro Kingdom", "Mushroom Kingdom"],
    "description": "Mario in a trendy outfit, showcasing his sense of style, primarily found in the Metro Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Football)",
    "id": 80,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario in his football uniform, ready to score a touchdown, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Mario (Gold)",
    "id": 81,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "Mario in a golden outfit, symbolizing his legendary status, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Mario (Golf)",
    "id": 82,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario in his golf attire, ready to hit the links, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Mario (Hakama)",
    "id": 83,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario in traditional Japanese hakama, embracing cultural attire, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Mario (Happi)",
    "id": 84,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario in a colorful happi coat, celebrating festivals, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Mario (High Poly)",
    "id": 85,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario in a high-polygon model, showcasing modern graphics, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Mario (King)",
    "id": 86,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "Mario dressed as a king, ruling over his kingdom, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Mario (Knight)",
    "id": 87,
    "city": ["Ruined Kingdom", "Mushroom Kingdom"],
    "description": "Mario in a knight's armor, ready for battle, primarily found in the Ruined Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Luigi)",
    "id": 88,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "Mario wearing a Luigi-themed costume, honoring his brother, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Mario (Mechanic)",
    "id": 89,
    "city": ["Metro Kingdom", "Mushroom Kingdom"],
    "description": "Mario in his mechanic outfit, fixing machines and vehicles, primarily found in the Metro Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Musician)",
    "id": 90,
    "city": ["Metro Kingdom", "Mushroom Kingdom"],
    "description": "Mario in his musician outfit, playing tunes for everyone, primarily found in the Metro Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Painter)",
    "id": 91,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario in his painter outfit, creating beautiful artworks, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Mario (Peach)",
    "id": 92,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "Mario wearing a Peach-themed costume, blending in with royalty, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Mario (Pirate)",
    "id": 93,
    "city": ["Seaside Kingdom", "Mushroom Kingdom"],
    "description": "Mario in a pirate outfit, sailing the high seas, primarily found in the Seaside Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Poncho)",
    "id": 94,
    "city": ["Sand Kingdom", "Mushroom Kingdom"],
    "description": "Mario in a poncho, staying cool in the desert heat, primarily found in the Sand Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Resort)",
    "id": 95,
    "city": ["Seaside Kingdom", "Mushroom Kingdom"],
    "description": "Mario in his resort outfit, enjoying a tropical vacation, primarily found in the Seaside Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Sailor)",
    "id": 96,
    "city": ["Seaside Kingdom", "Mushroom Kingdom"],
    "description": "Mario in a sailor outfit, navigating the oceans, primarily found in the Seaside Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Samurai)",
    "id": 97,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario in a samurai outfit, embracing ancient warrior traditions, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Mario (Satellaview)",
    "id": 98,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario in a retro outfit inspired by the Satellaview era, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Mario (Scientist)",
    "id": 99,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario in his scientist outfit, conducting experiments, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Mario (Skeleton)",
    "id": 100,
    "city": ["Ruined Kingdom", "Mushroom Kingdom"],
    "description": "Mario in a spooky skeleton costume, perfect for Halloween, primarily found in the Ruined Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Snow)",
    "id": 101,
    "city": ["Snow Kingdom", "Mushroom Kingdom"],
    "description": "Mario in his snow outfit, staying warm in the icy tundra, primarily found in the Snow Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Space)",
    "id": 102,
    "city": ["Moon Kingdom", "Mushroom Kingdom"],
    "description": "Mario in a space suit, exploring the cosmos, primarily found in the Moon Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Sunshine)",
    "id": 103,
    "city": ["Seaside Kingdom", "Mushroom Kingdom"],
    "description": "Mario in his tropical outfit, inspired by his adventures in Isle Delfino, primarily found in the Seaside Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Swimwear)",
    "id": 104,
    "city": ["Seaside Kingdom", "Mushroom Kingdom"],
    "description": "Mario in his swimwear, ready for a day at the beach, primarily found in the Seaside Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Topper)",
    "id": 105,
    "city": ["Cap Kingdom", "Mushroom Kingdom"],
    "description": "Mario wearing a fancy top hat, blending in with the Cap Kingdom's residents, primarily found in the Cap Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Tuxedo)",
    "id": 106,
    "city": ["Metro Kingdom", "Mushroom Kingdom"],
    "description": "Mario in a classic tuxedo, perfect for formal events, primarily found in the Metro Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Mario (Waluigi)",
    "id": 107,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario wearing a Waluigi-themed costume, embracing his mischievous side, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Mario (Wario)",
    "id": 108,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Mario wearing a Wario-themed costume, channeling his greedy alter ego, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Megane",
    "id": 109,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A bespectacled NPC who provides helpful advice and quests, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Mummy",
    "id": 110,
    "city": ["Sand Kingdom", "Ruined Kingdom"],
    "description": "A mummified creature found in the ancient ruins of the Sand Kingdom, also seen in the Ruined Kingdom."
  },
  {
    "name": "Nokonoko NPC",
    "id": 111,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A friendly Koopa Troopa NPC who offers quests and information, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Paragoomba",
    "id": 112,
    "city": ["Mushroom Kingdom", "Bowser's Kingdom"],
    "description": "A winged variant of the Goomba, capable of short flights, primarily found in the Mushroom Kingdom but also in Bowser's Kingdom."
  },
  {
    "name": "Pauline (Dress)",
    "id": 113,
    "city": ["Metro Kingdom", "Mushroom Kingdom"],
    "description": "Pauline in her elegant dress, the mayor of New Donk City, primarily found in the Metro Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Pauline (Mayor)",
    "id": 114,
    "city": ["Metro Kingdom", "Mushroom Kingdom"],
    "description": "Pauline in her official mayor outfit, leading New Donk City, primarily found in the Metro Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Peach",
    "id": 115,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "Princess Peach, the beloved ruler of the Mushroom Kingdom, also seen in the Cap Kingdom."
  },
  {
    "name": "Peach (Explorer)",
    "id": 116,
    "city": ["Mushroom Kingdom", "Cascade Kingdom"],
    "description": "Princess Peach in her explorer outfit, ready for adventure, primarily found in the Mushroom Kingdom but also in the Cascade Kingdom."
  },
  {
    "name": "Peach (Farmer)",
    "id": 117,
    "city": ["Mushroom Kingdom", "Wooded Kingdom"],
    "description": "Princess Peach in her farmer outfit, tending to crops, primarily found in the Mushroom Kingdom but also in the Wooded Kingdom."
  },
  {
    "name": "Peach (Summer)",
    "id": 118,
    "city": ["Seaside Kingdom", "Mushroom Kingdom"],
    "description": "Princess Peach in her summer outfit, enjoying the sunny weather, primarily found in the Seaside Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Peach (Swimwear)",
    "id": 119,
    "city": ["Seaside Kingdom", "Mushroom Kingdom"],
    "description": "Princess Peach in her swimwear, relaxing by the beach, primarily found in the Seaside Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Peach (Wedding)",
    "id": 120,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "Princess Peach in her wedding dress, ready for a royal ceremony, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Peach (Winter)",
    "id": 121,
    "city": ["Snow Kingdom", "Mushroom Kingdom"],
    "description": "Princess Peach in her winter outfit, staying warm in the snow, primarily found in the Snow Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Peach (Yukata)",
    "id": 122,
    "city": ["Mushroom Kingdom", "Metro Kingdom"],
    "description": "Princess Peach in a traditional yukata, celebrating cultural festivals, primarily found in the Mushroom Kingdom but also in the Metro Kingdom."
  },
  {
    "name": "Pokio",
    "id": 123,
    "city": ["Wooded Kingdom", "Mushroom Kingdom"],
    "description": "A bird-like creature with a long beak, used for climbing and stabbing, primarily found in the Wooded Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Poochie",
    "id": 124,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A friendly dog NPC who accompanies Mario on his adventures, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Pukupuku",
    "id": 125,
    "city": ["Lake Kingdom", "Seaside Kingdom"],
    "description": "A small, fish-like creature found in the waters of the Lake Kingdom, also seen in the Seaside Kingdom."
  },
  {
    "name": "Rabbit",
    "id": 126,
    "city": ["Wooded Kingdom", "Mushroom Kingdom"],
    "description": "A fast and agile rabbit found in the forests, primarily in the Wooded Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Runaway Lizard",
    "id": 127,
    "city": ["Sand Kingdom", "Ruined Kingdom"],
    "description": "A speedy lizard that runs away when approached, primarily found in the Sand Kingdom but also in the Ruined Kingdom."
  },
  {
    "name": "Sea Man",
    "id": 128,
    "city": ["Seaside Kingdom", "Lake Kingdom"],
    "description": "A sea-dwelling NPC who provides quests and information, primarily found in the Seaside Kingdom but also in the Lake Kingdom."
  },
  {
    "name": "Sea Woman",
    "id": 129,
    "city": ["Seaside Kingdom", "Lake Kingdom"],
    "description": "A sea-dwelling NPC who offers guidance and rewards, primarily found in the Seaside Kingdom but also in the Lake Kingdom."
  },
  {
    "name": "Senobi",
    "id": 130,
    "city": ["Mushroom Kingdom", "Wooded Kingdom"],
    "description": "A tall, stretching creature that helps Mario reach high places, primarily found in the Mushroom Kingdom but also in the Wooded Kingdom."
  },
  {
    "name": "Shibaken",
    "id": 131,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A dog-like NPC who provides quests and rewards, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Snow Man",
    "id": 132,
    "city": ["Snow Kingdom", "Mushroom Kingdom"],
    "description": "A snowman NPC found in the icy tundra of the Snow Kingdom, also seen in the Mushroom Kingdom during winter."
  },
  {
    "name": "Snow Man Leader",
    "id": 133,
    "city": ["Snow Kingdom", "Mushroom Kingdom"],
    "description": "The leader of the Snow Men, guiding others in the Snow Kingdom, also seen in the Mushroom Kingdom during winter."
  },
  {
    "name": "Snow Man Racer",
    "id": 134,
    "city": ["Snow Kingdom", "Mushroom Kingdom"],
    "description": "A Snow Man who participates in races and challenges, primarily found in the Snow Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Sphinx (Quiz)",
    "id": 135,
    "city": ["Sand Kingdom", "Ruined Kingdom"],
    "description": "A sphinx that challenges Mario with riddles and quizzes, primarily found in the Sand Kingdom but also in the Ruined Kingdom."
  },
  {
    "name": "Sphinx (Ride)",
    "id": 136,
    "city": ["Sand Kingdom", "Ruined Kingdom"],
    "description": "A sphinx that Mario can ride to traverse the desert, primarily found in the Sand Kingdom but also in the Ruined Kingdom."
  },
  {
    "name": "T-Rex",
    "id": 137,
    "city": ["Cascade Kingdom", "Ruined Kingdom"],
    "description": "A massive dinosaur that Mario can ride to break through obstacles, primarily found in the Cascade Kingdom but also in the Ruined Kingdom."
  },
  {
    "name": "Talkatoo",
    "id": 138,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A parrot-like creature that repeats phrases and provides hints, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Tank",
    "id": 139,
    "city": ["Bowser's Kingdom", "Ruined Kingdom"],
    "description": "A heavily armored enemy that fires projectiles at Mario, primarily found in Bowser's Kingdom but also in the Ruined Kingdom."
  },
  {
    "name": "Tiara",
    "id": 140,
    "city": ["Cap Kingdom", "Mushroom Kingdom"],
    "description": "A sentient tiara that assists Mario on his adventures, primarily found in the Cap Kingdom but also in the Mushroom Kingdom."
  },
  {
    "name": "Toadette",
    "id": 141,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A cheerful Toad who accompanies Mario on his adventures, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Togezo",
    "id": 142,
    "city": ["Mushroom Kingdom", "Bowser's Kingdom"],
    "description": "A spiky enemy that rolls around and damages Mario on contact, primarily found in the Mushroom Kingdom but also in Bowser's Kingdom."
  },
  {
    "name": "Topper",
    "id": 143,
    "city": ["Cap Kingdom", "Mushroom Kingdom"],
    "description": "A resident of the Cap Kingdom who wears a fancy top hat, also seen in the Mushroom Kingdom."
  },
  {
    "name": "Volbonan",
    "id": 144,
    "city": ["Luncheon Kingdom"],
    "description": "A friendly NPC who provides quests and rewards, primarily found in the Mushroom Kingdom but also in the Luncheon Kingdom."
  },
  {
    "name": "Volbonan (Chef)",
    "id": 145,
    "city": ["Luncheon Kingdom"],
    "description": "A skilled chef from the Luncheon Kingdom who prepares delicious dishes, also seen in the Mushroom Kingdom."
  },
  {
    "name": "Volbonan (Small, Chef)",
    "id": 146,
    "city": ["Luncheon Kingdom"],
    "description": "A smaller variant of Volbonan who works as a chef, primarily found in the Mushroom Kingdom but also in the Luncheon Kingdom."
  },
  {
    "name": "Yoshi",
    "id": 147,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "Mario's loyal dinosaur companion, known for his long tongue and egg-laying abilities, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Yoshi Egg",
    "id": 148,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "An egg laid by Yoshi, which can be used as a projectile or to hatch a new Yoshi, primarily found in the Mushroom Kingdom but also in the Cap Kingdom."
  },
  {
    "name": "Bird (Cap)",
    "id": 149,
    "city": ["Cap Kingdom", "Mushroom Kingdom"],
    "description": "A small bird that inhabits the Cap Kingdom, often perched on top hats, also seen in the Mushroom Kingdom."
  },
  {
    "name": "Bird (City)",
    "id": 150,
    "city": ["Metro Kingdom", "Mushroom Kingdom"],
    "description": "An urban bird commonly seen flying around the Metro Kingdom skyscrapers, also found in the Mushroom Kingdom."
  },
  {
    "name": "Bird (Cloud)",
    "id": 151,
    "city": ["Cloud Kingdom", "Cascade Kingdom"],
    "description": "A bird that soars gracefully through the skies of the Cloud Kingdom, also seen in the Cascade Kingdom."
  },
  {
    "name": "Bird (Sky)",
    "id": 152,
    "city": ["Cloud Kingdom", "Cascade Kingdom"],
    "description": "A rare bird that flies at high altitudes, barely visible from the ground, primarily found in the Cloud Kingdom but also in the Cascade Kingdom."
  },
  {
    "name": "Bird",
    "id": 153,
    "city": ["Mushroom Kingdom", "Cap Kingdom"],
    "description": "A generic bird found in Mushroom Kingdom, often seen flying or perched, also found in the Cap Kingdom."
  },
  {
    "name": "Volbonan (Small)",
    "id": 154,
    "city": ["Luncheon Kingdom"],
    "description": "A smaller variant of Volbonan, often seen helping out in the Mushroom Kingdom, also found in the Luncheon Kingdom."
  }
]
